StoveSim/gci_boundaryconds/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    primary_inlet
    {
        type            zeroGradient;
    }
	secondary_air_RHS
    {
        type            zeroGradient;
    }
	secondary_air_LHS
    {
        type            zeroGradient;
    }
    outlet_LHS
    {
        type            totalPressure;
        p0              $internalField;
    }
	outlet_RHS
    {
        type            totalPressure;
        p0              $internalField;
    }
    stove_body
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
